{
  "architectures": [
    "STLEncoderModel"
  ],
  "auto_map": {
    "AutoConfig": "configuration_stlenc.STLEncoderConfig",
    "AutoModel": "modeling_stlenc.STLEncoderModel"
  },
  "dtype": "float32",
  "embedding_dim_target": 1024,
  "hidden_size": 1024,
  "intermediate_size": 4096,
  "max_position_embeddings": 512,
  "model_type": "stl_encoder",
  "num_attention_heads": 16,
  "num_hidden_layers": 12,
  "transformers_version": "4.57.3",
  "vocab_size": 35
}
